Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If the goal is to disable selected hotkeys or hotstrings automatically based on the type of window that is active, Hotkey "^!c", "Off" is usually less convenient than using #HotIf with WinActive/WinExist (or their dynamic counterparts HotIfWinActive/Exist).
ja: アクティブなウィンドウの種類に応じて選択したホットキーやホットストリングを自動的に無効にすることを目的とする場合、Hotkey "^!c", "Off" は通常、WinActive/WinExist（またはその動的対応であるHotIfWinActive/Exist）で#HotIfを使用するより利便性が低くなります。

source: If the group doesn't exist, it will be created.
ja: グループが存在しない場合は、作成されます。

source: If the handle is invalid or does not correspond to a menu created by this script, the function returns an empty string.
ja: ハンドルが無効なときやこのスクリプトで作成したメニューに該当しなときは、この関数は空文字列を返します。

source: If the hotkey variant already exists, its behavior is updated according to whether KeyName includes or excludes the tilde (~) prefix.
ja: ホットキーバリアントがすでに存在する場合、KeyNameがチルダ（~）接頭辞を含むか含まないかによって、その動作が更新されます。

source: If the hotkey's condition isn't met and there is no unconditional variant of the hotkey, the keypress is passed on to the active window as though the hotkey wasn't defined in the first place.
ja: ホットキーの条件が満たされず、ホットキーの無条件変形がない場合、ホットキーがそもそも定義されていないかのように、キー入力はアクティブウィンドウに引き継がれます。

source: If the hotstring already exists, any options specified in String are put into effect, while all other options are left as is.
ja: hotstringが既に存在する場合、Stringで指定されたオプションは有効になり、それ以外のオプションはそのままになります。

source: If the icon group indicated by IconNumber contains multiple icon sizes, the closest match is used and the icon is scaled to the specified size.
ja: IconNumberで示されるアイコングループに複数のアイコンサイズが含まれる場合、最も近いサイズのアイコンを使用し、指定されたサイズに拡大縮小されます。

source: If the image needs to be freed from memory, call whichever function is appropriate for the type of handle.
ja: 画像をメモリから解放する必要がある場合は、ハンドルの種類に応じて適切な関数を呼び出します。

source: If the image on the screen is translucent, ImageSearch will probably fail to find it.
ja: 画面上の画像が半透明な場合、ImageSearchはおそらく検索に失敗します。

source: If the input value is numeric, it is automatically converted to a string before the Width and Precision arguments are applied.
ja: 入力値が数値の場合、Widthと Precisionの引数が適用される前に、自動的に文字列に変換されます。

source: If the input value is outside the expected range, it wraps around.
ja: 入力値が想定範囲外の場合、折り返す。

source: If the installer is not already running as admin, it will attempt to elevate when the Install button is clicked, as indicated by the shield icon on the button.
ja: インストーラがまだ管理者として実行されていない場合、インストールボタンがクリックされると、ボタン上のシールドアイコンで示されるように、昇格を試みます。

source: If the interface is not supported, the return value is zero.
ja: インターフェイスがサポートされていない場合、戻り値は0である。

source: If the item is a subkey, RegDelete() only deletes its default value.
ja: 項目がサブキーの場合、RegDelete()はそのデフォルト値のみを削除する。

source: If the item is a subkey, RegDeleteKey() deletes the key itself.
ja: 項目がサブキーのときは、RegDeleteKey()はそのサブキーそのものを削除します。

source: If the item is a subkey, the full name of that subkey is used by default.
ja: 項目がサブキーのときは、デフォルトでそのサブキーのフルネームが使用されます。

source: If the item is a value, RegDeleteKey() deletes the key which contains that value, including all subkeys and values.
ja: 項目が値とのときは、RegDeleteKey()はその値を含むキーをサブキーを含めて全て削除します。

source: If the item is a value, ValueName defaults to the name of that value, but can be overridden.
ja: 項目が値の場合、ValueNameのデフォルトはその値の名前であるが、オーバーライドすることができる。

source: If the item is a value, ValueType and ValueName default to the type and name of that value, but can be overridden.
ja: 項目が値の場合、ValueTypeとValueNameのデフォルトはその値の型と名前であるが、オーバーライドすることができる。

source: If the item is checked, a bullet point is used instead of a check mark.
ja: 項目にチェックが入っている場合は、チェックマークの代わりに箇条書きを使用します。

source: If the key is a standard modifier key or CapsLock, NumLock or ScrollLock, it is not suppressed.
ja: キーが標準の修飾キー、またはCapsLock、NumLock、ScrollLockの場合は、抑制されません。

source: If the key is deleted during the loop, RegCreateKey can be used to recreate it.
ja: ループ中にキーが削除された場合、RegCreateKeyを使用して再作成することができます。

source: If the key or button achieves the specified state, the function will not wait for the timeout to expire.
ja: キーまたはボタンが指定された状態になった場合、この関数はタイムアウトを待たずに終了します。

source: If the last known reference to the object was released, the object would be deleted.
ja: オブジェクトへの最後の既知の参照が解放された場合、オブジェクトは削除される。

source: If the last found window is a hidden Gui window, it can be used even when DetectHiddenWindows is turned off.
ja: 最後に見つかったウィンドウが非表示のGUIウィンドウの場合、DetectHiddenWindowsがオフになっていても使用できる。

source: If the launcher is compiled, its usage is essentially the same as AutoHotkey.exe except for the additional launcher switches.
ja: ランチャーがコンパイルされている場合、追加のランチャースイッチを除いて、その使用方法は基本的にAutoHotkey.exeと同じです。

source: If the left operand (which must be a variable) has a value, it becomes the result and the right branch is skipped.
ja: 左オペランド（変数でなければならない）に値があれば、それが結果となり、右分岐はスキップされる。

source: If the length of a line exceeds this, its remaining characters will be read during the next loop iteration.
ja: 行の長さがこれを超える場合は、次のループの繰り返しで残りの文字が読み取られます。

source: If the length of a line exceeds this, the remainder of the line is returned by subsequent calls to this method.
ja: 行の長さがこれを超える場合、それ以降このメソッドを呼び出すと、行の残りが返されます。

source: If the length of the string is changed this way, the variable's internal length property must be updated by calling VarSetStrCapacity(&MyVar, -1).
ja: この方法で文字列の長さを変更する場合は、VarSetStrCapacity(&MyVar, -1)を呼び出して、変数内部の長さプロパティを更新する必要があります。

source: If the length of the string is changed this way, the variable's internal length property must be updated by calling VarSetStrCapacity(MyVar, -1).
ja: この方法で文字列の長さを変更する場合は、VarSetStrCapacity(MyVar, -1)を呼び出して、変数内部の長さプロパティを更新する必要があります。

source: If the letter exists in the current keyboard layout, it is always sent as whichever keycode the layout associates with that letter (unless the Text mode is used, in which case the character is sent by other means).
ja: 現在のキーボードレイアウトにその文字が存在する場合、そのレイアウトがその文字に関連付けるキーコードとして常に送信されます（テキストモードが使用されていない場合、その文字は他の手段で送信されます）。

source: If the line above the continuation section ends with a name character and the section does not start inside a quoted string, a single space is automatically inserted to separate the name from the contents of the continuation section.
ja: 継続セクションの上の行が名前文字で終わっており、そのセクションが引用符で囲まれた文字列で始まっていない場合、名前と継続セクションの内容を区切るために、1つのスペースが自動的に挿入される。

source: If the list-view control has the LVS_AUTOARRANGE style, the control will not autoarrange its icons until one or more work areas are defined (see LVM_SETWORKAREAS).
ja: リストビューコントロールにLVS_AUTOARRANGEスタイルが設定されている場合、1つ以上のワークエリアが定義されるまで、アイコンの自動配置は行われません（LVM_SETWORKAREASを参照）。

source: If the main window is being destroyed, it may still exist but cannot be displayed.
ja: メインウィンドウが破壊されている場合、存在しても表示できないことがあります。

source: If the map does not contain this key, an UnsetItemError is thrown.
ja: マップにこのキーが含まれていない場合、UnsetItemErrorが投げられる。

source: If the message box times out, the return value is the word Timeout.
ja: メッセージボックスがタイムアウトした場合、戻り値はTimeoutという文字になります。

source: If the message is not processed within this time, a TimeoutError is thrown.
ja: この時間内にメッセージが処理されない場合、TimeoutErrorが投げられます。

source: If the message is posted rather than sent and has a number greater than 0x0311, it can be buffered until its function completes by specifying Critical as the first line of the function.
ja: メッセージが送信ではなく投稿であり、0x0311より大きい番号を持つ場合、関数の最初の行にCriticalを指定することで、その関数が完了するまでバッファリングすることができます。

source: If the method accepts a combination of VT_BYREF and VT_VARIANT as shown above, a VarRef can be used instead.
ja: 上記のようにメソッドがVT_BYREFとVT_VARIANTの組み合わせを受け付ける場合、VarRefを代わりに使用することができます。

source: If the method is not found or cannot be retrieved without invoking a property getter, a MethodError is thrown.
ja: メソッドが見つからない場合、またはプロパティゲッターを呼び出さずに取得できない場合は、MethodErrorがスローされます。

source: If the method is of a type that does not return a value (the void return type in C), specify "Int" or any other numeric type without any suffix (except HRESULT), and ignore the return value.
ja: メソッドが値を返さない型（Cではvoid戻り値型）の場合、「Int」または接尾辞のない他の数値型（HRESULTを除く）を指定し、戻り値を無視します。

source: If the method is of a type that does not return a value (with return type defined in C as void), the result is undefined and should be ignored.
ja: メソッドが値を返さない型（Cで定義された戻り値の型がvoid）の場合、結果は未定義であり、無視されるべきです。

source: If the monitor function directly or indirectly causes the message to be sent again while the function is still running, it is necessary to specify a MaxThreads value greater than 1 or less than -1 to allow the monitor function to be called for the new message (if desired).
ja: モニタ関数が直接または間接的に、その関数の実行中にメッセージを再送信させる場合、（必要であれば）新しいメッセージに対してモニタ関数が呼び出されるように、1より大きいか-1より小さいMaxThreads値を指定することが必要です。

source: If the mouse hardware reports distances of less than one notch, A_EventInfo may be less than 120;
ja: マウスのハードウェアが1ノッチ未満の距離を報告する場合、A_EventInfoは120未満である可能性があります。

source: If the mouse supports it, horizontal scrolling can be detected via the key names WheelLeft and WheelRight.
ja: マウスがサポートしている場合、WheelLeftとWheelRightのキー名で水平スクロールを検出することができます。

source: If the name for the resource is not specified, it defaults to 1
ja: リソース名が指定されていない場合、デフォルトは1です

source: If the name of a DLL or EXE file is given without a path, it may be loaded from the directory of the current executable (AutoHotkey.exe or a compiled script) or a system directory.
ja: DLLまたはEXEファイルの名前がパスなしで与えられた場合、現在の実行ファイル（AutoHotkey.exeまたはコンパイルされたスクリプト）のディレクトリまたはシステムディレクトリからロードされる場合があります。

source: If the new position would be outside the range of the control, the control is generally set to the nearest valid value.
ja: 新しい位置がコントロールの範囲外になる場合、コントロールは一般的に最も近い有効値に設定されます。

source: If the new process might create multiple windows, a window title and other criteria can be combined by delimiting them with spaces.
ja: 新しいプロセスで複数のウィンドウを作成する可能性がある場合、ウィンドウのタイトルとその他の条件をスペースで区切ることで組み合わせることができます。

source: If the newly active window is a match for any of the group's window specifications, it is left active.
ja: 新しくアクティブになったウィンドウが、グループのウィンドウ指定のいずれかと一致する場合、そのウィンドウはアクティブのままになります。

source: If the newly active window is a match for the same window specification as the window that was just closed, it is left active even though the default Mode would normally dictate that the oldest window should be activated next.
ja: 新しくアクティブになったウィンドウが、直前に閉じたウィンドウと同じウィンドウ仕様にマッチする場合、デフォルトのモードでは 最も古いウィンドウを次にアクティブにするように指示されているにもかかわらず、そのウィンドウはアクティブのままです。

source: If the number begins with a plus or minus sign, the current setting will be adjusted up or down by the indicated amount.
ja: 数値がプラス記号またはマイナス記号で始まる場合、現在の設定は指示された量だけ上下に調整されます。

source: If the number of bytes read is non-zero but less than the size of NumType, the missing bytes are assumed to be zero.
ja: 読み込んだバイト数が0でなく、NumTypeのサイズより小さい場合、不足するバイトは0とみなされます。

source: If the number of parameters is not known, a variadic function can be used.
ja: パラメータの数がわからない場合は、変分関数を使用することができます。

source: If the number of parameters passed into a script varies (perhaps due to the user dragging and dropping a set of files onto a script), the following example can be used to extract them one by one:
ja: スクリプトに渡されるパラメータの数がさまざまな場合（おそらく、ユーザーが一連のファイルをスクリプトにドラッグ＆ドロップしたため）、次の例を使用して、パラメータを1つずつ抽出することができます：

source: If the number was intended to be negative, convert it to a signed 32-bit integer by using OutputVar := OutputVar << 32 >> 32 or similar.
ja: 負の数を想定していた場合は、OutputVar := OutputVar << 32 >> 32などで符号付き32ビット整数に変換する。

source: If the object does not support the IConnectionPointContainer interface or type information about the object's class cannot be retrieved, an error message is shown.
ja: オブジェクトが IConnectionPointContainer インターフェースをサポートしていない場合、またはオブジェクトのクラスに関する型情報を取得できない場合は、エラーメッセージを表示します。

source: If the object has no HWND property or the property's value is not an integer, a PropertyError or TypeError is thrown.
ja: オブジェクトにHWNDプロパティがないか、プロパティの値が整数でない場合、PropertyErrorまたはTypeErrorがスローされます。

source: If the object has no such method, a MethodError is thrown.
ja: オブジェクトにそのようなメソッドがない場合、MethodErrorがスローされます。

source: If the object is hosted by a remote process and the process terminates unexpectedly, it may take several minutes for the system to release the connection.
ja: オブジェクトがリモートプロセスによってホストされており、そのプロセスが予期せず終了した場合、システムが接続を解除するまでに数分かかることがあります。

source: If the object is not an Array, __Enum is called with a count of 1 and the enumerator is called with only one parameter at a time.
ja: オブジェクトがArrayでない場合、__Enumは1カウントで呼び出され、列挙者は一度に1つのパラメータのみで呼び出されます。

source: If the open-bracket is not preceded by a value (or a sub-expression which yields a value), it is interpreted as the beginning of an array literal.
ja: オープンブラケットに値（または値を返す部分式）が先行しない場合、配列リテラルの開始として解釈される。

source: If the operand is a floating point value, a TypeError is thrown.
ja: オペランドが浮動小数点値の場合、TypeErrorがスローされます。

source: If the options Case, CaseLocale, and Logical are all omitted, the uppercase letters A-Z are considered identical to their lowercase counterparts for the purpose of the sort.
ja: Case、CaseLocale、Logicalの各オプションが省略された場合、大文字のA〜Zは小文字と同一とみなされ、ソートが行われます。

source: If the output file exists, it is overwritten.
ja: 出力ファイルが存在する場合は上書きされる。

source: If the owner window is eligible (not a match for the group), either the owner window or one of its owned windows is activated; whichever was active last.
ja: オーナーウィンドウが適格（グループと一致しない）である場合、オーナーウィンドウまたはその所有ウィンドウのいずれか、最後にアクティブだった方をアクティブにします。

source: If the parameter accepts input, the script must also convert the input string to the appropriate format; StrPut can be used for this.
ja: パラメータが入力を受け付ける場合、スクリプトは入力文字列を適切な形式に変換する必要があります。このためにStrPutを使用することができます。

source: If the parameter does not contain an ampersand, all ampersands are ignored, including literal ones.
ja: パラメータにアンパサンドが含まれていない場合、リテラルも含めてすべてのアンパサンドが無視されます。

source: If the parameter is a pointer to a single numeric value such as LPDWORD or int*, generally the * or P suffix should be used instead of "Ptr".
ja: パラメータがLPDWORDやint*のような単一の数値へのポインタの場合、一般に「Ptr」の代わりに*またはP接尾辞を使用する必要があります。

source: If the parameter is omitted, it defaults to Force.
ja: パラメータが省略された場合、デフォルトはForceになります。

source: If the parameter is optional and the caller omits it, the parameter acts as a normal local variable.
ja: パラメータがオプションで、呼び出し側がそれを省略した場合、パラメータは通常のローカル変数として動作します。

source: If the parameters are file names, the following example can be used to convert them to their case-corrected long names (as stored in the file system), including complete/absolute path:
ja: パラメータがファイル名の場合、以下の例を使用すると、完全/絶対パスを含め、（ファイルシステムに保存されている）大文字/小文字を補正した長い名前に変換することができる：

source: If the parent process is no longer running, there is some risk that the returned PID has been reused by the system, and now identifies a different process.
ja: 親プロセスが既に実行されていない場合、返されたPIDがシステムによって再利用され、別のプロセスを識別している可能性があります。

source: If the path is invalid (for example, because the drive does not exist), the return value is an empty string.
ja: パスが無効な場合（例えば、ドライブが存在しない場合）、戻り値は空文字列となります。

source: If the pattern begins with (*UCP), Unicode properties will be used to determine which characters match.
ja: パターンが(*UCP)で始まる場合、Unicodeプロパティがどの文字がマッチするかを決定するために使用されます。

source: If the pattern is not found (that is, if the function returns 0), this variable is made blank.
ja: パターンが見つからない場合（つまり、関数が0を返す場合）、この変数は空白にされる。

source: If the percentage number begins with a minus sign or is unsigned, it does not need to be enclosed in quotation marks.
ja: パーセントを表す数字がマイナス記号で始まるか符号がないときは、引用符で囲む必要はありません。

source: If the prefix key is also used as a suffix in another hotkey, by default that hotkey is fired upon release, and is not fired at all if it was used to activate a custom combination.
ja: プレフィックスキーが他のホットキーのサフィックスとしても使用されている場合、デフォルトではそのホットキーはリリース時に起動され、カスタムコンビネーションの起動に使用されている場合は全く起動されません。

source: If the previous instance is running at a higher integrity level than the new instance (where running as administrator > running with UI access > normal), it cannot be closed due to security restrictions.
ja: 以前のインスタンスが新しいインスタンスよりも高い整合性レベルで実行されている場合（管理者として実行＞UIアクセスで実行＞通常の場合）、セキュリティ上の制限により閉じることができません。

source: If the program accepts command-line parameters, they can be passed as part of the Run function's first parameter.
ja: プログラムがコマンドラインパラメーターを受け付ける場合は、Run関数の最初のパラメーターの一部として渡すことができます。

source: If the program changes the .exe, the altered .exe must be moved back to the input file specified by %A_WorkFileName%, by the program.
ja: プログラムが.exeを変更した場合、変更された.exeは、プログラムによって%A_WorkFileName%で指定された入力ファイルに戻される必要があります。

source: If the program you are trying to start is in A_WinDir "\System32" and you are using AutoHotkey 32-bit on a 64-bit system, the File System Redirector may be interfering.
ja: 起動しようとしているプログラムがA_WinDir "\System32"にあり、64ビットシステムでAutoHotkey 32ビットを使用している場合、ファイルシステムリダイレクトが干渉している可能性があります。

source: If the program/document name or a parameter contains spaces, it is safest to enclose it in double quotes (even though it may work without them in some cases).
ja: プログラム/ドキュメント名やパラメータにスペースが含まれる場合は、二重引用符で囲むのが最も安全です（場合によっては引用符なしでも動作することがあります）。

source: If the property doesn't already exist, it is created.
ja: そのプロパティがまだ存在しない場合は、作成される。

source: If the property has a getter method, it is called to obtain the value (unless Value is omitted).
ja: プロパティにゲッターメソッドがある場合は、そのメソッドを呼び出して値を取得します（Valueが省略された場合を除く）。

source: If the property is 0 (false), the key is suppressed.
ja: プロパティが0 (false)の場合、キーは抑制されます。

source: If the property is false, the key is suppressed.
ja: プロパティが false の場合、キーは抑制されます。

source: If the region to be searched is large and the search is repeated with high frequency, it may consume a lot of CPU time.
ja: 検索する領域が大きく、高い頻度で検索を繰り返す場合、CPU時間を多く消費する可能性があります。

source: If the result is intended to be a 32-bit signed integer (a value from -2147483648 to 2147483648), it can be truncated to 32-bit and converted to a signed value as follows:
ja: 結果が32ビット符号付き整数（-2147483648から2147483648までの値）を意図している場合、次のように32ビットに切り捨てて符号付き値に変換することができます：

source: If the result of A_TickCount - StartTime is greater than the result of 2*MaxTime + 100, show "Too much time has passed." and terminate the script.
ja: A_TickCount - StartTimeの結果が2*MaxTime + 100の結果より大きい場合、「Too much time has passed.」と表示し、スクリプトを終了します。

source: If the retrieved text appears to be truncated (incomplete), it may be necessary to retrieve the text by sending the WM_GETTEXT message via SendMessage instead.
ja: 取得したテキストが不完全で切り捨てられたように見えるときは代わりにSendMessageでWM_GETTEXTメッセージを送信してテキストを取得する必要があるかもしれません。

source: If the return value of the function is not needed and the function name is written at the start of the line (or in other contexts which allow a statement, such as following else or a hotkey), the parentheses can be omitted.
ja: 関数の戻り値が必要なく、関数名が行頭に書かれている場合（またはelseや ホットキーに続くなど、ステートメントを許可する他のコンテキスト）、括弧を省略することができます。

source: If the sc or vk portion is omitted, the most appropriate value is sent in its place.
ja: sc または vk の部分が省略された場合、最も適切な値が代わりに送信されます。

source: If the script absolutely requires admin rights, check A_IsAdmin a second time in case *RunAs failed to elevate the script (i.e. because UAC is disabled).
ja: スクリプトにどうしても管理者権限が必要な場合、*RunAsでスクリプトの昇格に失敗した場合（UACが無効になっている場合など）に備えて、A_IsAdminを2回目もチェックします。

source: If the script allows multiple instances, Reload may fail to identify the correct instance.
ja: スクリプトが複数のインスタンスを許可している場合、Reloadが正しいインスタンスを識別できないことがあります。

source: If the script assigns to other.foo, the value is stored in other and any further changes to thing.foo will have no effect on other.foo.
ja: スクリプトがother.fooに代入した場合、その値はotherに格納され、thing.fooをさらに変更してもother.fooには影響しません。

source: If the script cannot be reloaded -- perhaps because it has a syntax error -- the original instance of the script will continue running.
ja: スクリプトを再読み込みできない場合（構文エラーなど）、スクリプトの元のインスタンスが実行され続けます。

source: If the script contains syntax errors, the output file may be empty.
ja: スクリプトに構文エラーが含まれている場合、出力ファイルは空になることがあります。

source: If the script contains the #Requires directive, the launcher looks for an exe that satisfies the requirement.
ja: スクリプトに#Requiresディレクティブが含まれている場合、ランチャーはその要件を満たすexeを探します。

source: If the script does not have the keyboard hook installed, the KeyHistory window will display only the keyboard events generated by the script itself (i.e. not the user's).
ja: スクリプトにキーボードフックがインストールされていない場合、KeyHistoryウィンドウには、スクリプト自体によって生成された（つまり、ユーザーのものではない）キーボードイベントのみが表示されます。

source: If the script does not have the mouse hook installed, mouse button events will not be shown.
ja: スクリプトにマウスフックがインストールされていない場合、マウスボタンイベントは表示されません。

source: If the script does not retain its own reference to PrefixOrSink, it can use __Delete to detect when this occurs.
ja: スクリプトがPrefixOrSinkへの参照を保持しない場合、__Deleteを使用することでその発生を検出することができます。

source: If the script exits for any reason, all "rolled up" windows will be automatically restored to their original heights.
ja: 何らかの理由でスクリプトが終了すると、すべての「ロールアップ」ウィンドウは自動的に元の高さに戻される。

source: If the script exits for any reason, all the windows that it hid will be unhidden automatically.
ja: 何らかの理由でスクリプトが終了すると、そのスクリプトが隠していたウィンドウはすべて自動的に隠されなくなる。

source: If the script has just resized the window, follow this example to ensure the Size event is raised immediately:
ja: スクリプトがウィンドウのサイズを変更したばかりの場合は、この例に従ってSizeイベントを直ちに発生させるようにしてください：

source: If the script has not been compiled, A_IsCompiled is defined even if the script has not been compiled; its value is "" in v1.1 and 0 in v2.0.
ja: スクリプトがコンパイルされていない場合でも、A_IsCompiledは定義されます。その値はv1.1では""、v2.0では0となる。

source: If the script is compiled or embedded, this is the full path of the current executable file.
ja: スクリプトがコンパイルまたは埋め込まれている場合、これは現在の実行可能ファイルのフルパスです。

source: If the script is compiled or embedded, this is the name of the current executable file.
ja: スクリプトがコンパイルまたは埋め込まれている場合、これは現在の実行可能ファイルの名前です。

source: If the script is embedded, A_LineFile contains an asterisk (*) followed by the resource name; e.g. *#1
ja: スクリプトが埋め込まれている場合、A_LineFileにはアスタリスク（*）の後にリソース名が続く、例：*#1

source: If the script is suspended, newly added/enabled hotkeys will also be suspended until the suspension is turned off (unless they are exempt as described in the Suspend section).
ja: スクリプトがサスペンドされている場合、新しく追加/有効になったホットキーも、サスペンドがオフになるまでサスペンドされます（サスペンドセクションで説明したように免除される場合を除く）。

source: If the script is suspended, newly added/enabled hotstrings will also be suspended until the suspension is turned off (unless they are exempt as described in the Suspend section).
ja: スクリプトが中断されると、新しく追加/有効になったホットストリングも中断が解除されるまで中断されます（中断セクションで説明したように除外される場合を除きます）。

source: If the script is compiled or the value does not identify a valid stack frame, the value is merely converted to a string and assigned to NewError.What.
ja: スクリプトがコンパイルされたり、値が有効なスタックフレームを特定できない場合、値は単に文字列に変換され、NewError.Whatに代入されます。

source: If the script is persistent, it will stay running after startup completes and all other threads have exited.
ja: スクリプトが永続的である場合、起動が完了し、他のすべてのスレッドが終了した後も実行され続けます。

source: If the script is already running, you can use the Edit function or right-click the script's tray icon and select Edit Script.
ja: スクリプトがすでに実行されている場合は、［編集］機能を使用するか、スクリプトのトレイ アイコンを右クリックして［スクリプトの編集］を選択します。

source: If the script is busy or unresponsive, such as if a FileCopy is in progress, expression evaluation is delayed and may time out.
ja: FileCopyの実行中など、スクリプトがビジー状態や無反応の場合、式の評価が遅れ、タイムアウトすることがあります。

source: If the script is directly terminated by any means, including the tray menu or ExitApp, any functions which have yet to return do not get the chance to do so.
ja: トレイメニューやExitAppなど、何らかの手段でスクリプトが直接終了した場合、まだ戻っていない関数はその機会を得られない。

source: If the script is exited, any currently-playing file that it started will stop.
ja: スクリプトが終了すると、スクリプトが開始した再生中のファイルはすべて停止する。

source: If the script is exiting due to a critical error or its main window being destroyed, it will unconditionally terminate after the OnExit thread completes.
ja: クリティカルエラーやメインウィンドウの破壊によってスクリプトが終了する場合、OnExitスレッドが完了した後に無条件で終了します。
